src/cf/Enums/ТипыПодписиКриптографии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<Enum>
		<Properties>
			<Name>ТипыПодписиКриптографии</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбычнаяCMS</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БазоваяCAdESBES</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СМеткойДоверенногоВремениCAdEST</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПолнымНаборомПроверочныхДанныхCAdESC</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLong</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESXLongType1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасширеннаяДолгосрочнаяCAdESXLongType2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>CAdESAv2</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрхивнаяCAdESAv3</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеОпределен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/ТипыПодписиКриптографии/Ext/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2023, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	СписокЗначений = Новый СписокЗначений;
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.БазоваяCAdESBES);
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.СМеткойДоверенногоВремениCAdEST);
	СписокЗначений.Добавить(Перечисления.ТипыПодписиКриптографии.АрхивнаяCAdESAv3);
	
	ДанныеВыбора = СписокЗначений;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
